// 1월 3일
// 프로그래밍 : 컴퓨터에게 "작업"을 수행하게 하려면 이를 컴퓨터가 "이해가능한 용어"로 알려 주는 것
// 소스코드 : 컴퓨터가 프로그램을 실행하려고, 사용자가 작성한 프로그래밍 언어
// 목적코드 : 컴퓨터가 알아 듣는 언어로 된 코드
// 컴파일 : 소스코드를 목적코드로 변환 처리를 해주는 도구
// 링크 : 컴파일러에 의해 만들어진 목적어들을 모드 연결하여 실행파일을 만들어주는 과정
// 빌드 : 컴파일과 링크를 합쳐서 빌드라고 부름
// 라이브러리 : 다른 사람이 작성한 코드로, 프로그래밍을 쉽게 도와주는 프로그램의 집합
// IDE(Integrated Development Environment) : VisualStudio, XCode 등과 같은 프로그램을 통합개발환경(IDE)라고함
// 함수 : 
// 에러 : 
// main() : 
// 솔루션 : 비쥬얼스튜디오에서 앱을 빌드하기 위해 필요한 모든 아이템(소스코드, 아이콘, 이미지등)을 모아둔 것
// 프로젝트 : 관련 있는 여러 개의 프로젝트를 모아 한 번에 관리하는 파일 구조
// 
// 
// 
// 
// 



// 
// 
// 
